#Задача 1
# number = int(input("Введи число: "))
# print(number, "*", number, "=", number * number)

#Задача 2
# num1 = int(input("Введи число1: "))
# num2 = int(input("Введи число2: "))
# print(num1, "/", num2, "=", num1 / num2)

#Задача 3
name = input("Как тебя зовут? ")
age = int(input("Сколько тебе лет? "))
print("Привет,", name)
print("Через", 100 - age, "лет/год/года тебе будет 100 лет")